### 상대경로/절대경로

### 1.라이브러리 정의

In [1]:
import pandas as pd

### 2. 파일데이터 불러오기

In [2]:
indata = pd.read_csv("../dataset/customerdata.csv")

     CUSTID     AVGPRICE  EMI  DEVICECOUNT  PRODUCTAGE          CUSTTYPE
0    A13566  4273.900000    3            6    1.679181  Big-Screen-lover
1    A14219  3642.441950    2            4    2.682023      Sleeping-dog
2    A15312  3653.884565    2            5    3.208202      Sleeping-dog
3    A16605  3713.211107    2            6    0.900000        Early-bird
4    B10634  3391.074215    2            4    2.453656      Sleeping-dog
..      ...          ...  ...          ...         ...               ...
145  Z13253  3678.800000    2            5    2.463670  Big-Screen-lover
146  Z13534  3662.437527    3            6    0.900000        Early-bird
147  Z16428  3516.500000    2            5    2.371301  Big-Screen-lover
148  Z16735  3300.100000    2            5    1.704942  Big-Screen-lover
149  Z19835  3326.526183    2            6    1.200000        Early-bird

[150 rows x 6 columns]

In [ ]:
indata.to_csv("./outData/csv", index)

In [2]:
carDataUrlPath = "https://raw.githubusercontent.com/hyokwan/python-lecture/master/dataset/cars.csv"

In [3]:
carData = pd.read_csv(carDataUrlPath)

     age  gender  miles   debt  income  sales
0     28       0     23      0    4099    620
1     26       0     27      0    2677   1792
2     30       1     58  41576    6215  27754
3     26       1     25  43172    7626  28256
4     20       1     17   6979    8071   4438
..   ...     ...    ...    ...     ...    ...
958   22       0     11   8778    9829   1593
959   19       1     23   4850    3470   4742
960   28       1     28   9312    2720  12771
961   50       0     29  51343    8713  28511
962   47       1     15   3735    6406   6104

[963 rows x 6 columns]

In [ ]:
carData.columns = [""]

In [9]:
data = pd.read_csv("../dataset/kopo_region_mst_hangul.csv", encoding="ms949")

In [12]:
data

   SALESID REGIONNAME
0      A00       아프리카
1      A01         미국
2      A02         한국
3      A03         독일
4      A04        브라질
..     ...        ...
68     A68      베네수엘라
69     A69        베트남
70     A70       바누아투
71     A71        NaN
72     A99         기타

[73 rows x 2 columns]

In [10]:
# 데이터 컬럼 재정의
data.columns = ["SALESID","REGIONNAME"]

In [ ]:
data.rename( columns={"SALESID":"SID",
                    "REGIONNAME":"SNAME"},
           inplace=True)

In [11]:
data

   SALESID REGIONNAME
0      A00       아프리카
1      A01         미국
2      A02         한국
3      A03         독일
4      A04        브라질
..     ...        ...
68     A68      베네수엘라
69     A69        베트남
70     A70       바누아투
71     A71        NaN
72     A99         기타

[73 rows x 2 columns]

In [17]:
data.to_csv("./hangul.csv",
            encoding="ms949",
           index=False)

In [14]:
data

   SALESID REGIONNAME
0      A00       아프리카
1      A01         미국
2      A02         한국
3      A03         독일
4      A04        브라질
..     ...        ...
68     A68      베네수엘라
69     A69        베트남
70     A70       바누아투
71     A71        NaN
72     A99         기타

[73 rows x 2 columns]

In [18]:
pwd

'C:\\Users\\SMART-09\\Desktop\\OneDrive_2021-03-09\\Session03 - 데이터베이스의 이해 및 ETL 실습'

### 1. 데이터 불러오기

In [51]:
targetData = "../dataset/kopo_product_volume.csv"

In [52]:
pd.read_csv(targetData, encoding="ms949")

### 2.데이터 변환(컬럼이름 소문자로 변경)

In [53]:
data.columns = ["regionid","productgroup","yearweek","volume"]

### 3. 데이터 저장

In [1]:
import pandas as pd

In [2]:
import psycopg2
from sqlalchemy import create_engine

In [3]:
mylocalpgUrl = "postgresql://postgres:postgres@127.0.0.1:5432/postgres"

In [4]:
engine_pg = create_engine(mylocalpgUrl)

In [5]:
resultTableName = "dd_out"

In [6]:
data = pd.read_csv("../../새 텍스트 문서.txt")

In [7]:
data.to_sql(name=resultTableName,
            con=mylocalpgUrl,
           if_exists="replace", index=False)

In [8]:
sqlReadData = pd.read_sql(sql="select * from dd_out", con=engine_pg)

In [9]:
pd.read_sql_table(table_name="pg_out", con=engine_pg)

ValueError: Table pg_out not found